package quiz.quiz1;

public class Quiz {

	// 문제 2 #필드문제    // Song 파일에 있음
	// 멜론 음악 차트를 관리하는 시스템
	// 목록을 관리하기 위해 클래스를 만들기로 했습니다
	// 제목, 가수명, 앨범명, 가사, 시간(초단위)
	// - 곡 2곡 이상의 정보를 저장하고
	// - 각 곡의 정보를 출력
	
	// 문제 3 #메소드문제      //Movie 파일에 있음
	// 영화 관리
	// 제목, 개봉년도
	// 메소드를 통해서
	// - 각 값을 따로 받아서 따로 저장하기
	//     + 제목만 받아서 필드에 저장하는 메소드
	// - 각 값을 하나만 돌려주는 메소드
	//     + 제목만 돌려주는 메소드
	// - 모든 정보를 이쁘게 출력
	// - 속편정보
	//   + 원래 제목에 "2"를 붙여서 돌려주는 메소드
	// 2개 이상의 영화를 관리해보자
	
	// 문제 4 #생성자문제
	// 카페 창업
	// 상호명, 필요자본금, 메뉴1, 메뉴2
	// 생성할 때 상호와 필요자본금을 꼭 입력해야 생성되도록
	// 그리고 생성과 동시에 메뉴1에는 "아아", 메뉴2는 "따아"
	
    
   // 문제5
   // * Emp
   //    - 사번, 이름, 직급, 연봉, 상사의 사번
   //    - 모든 정보를 출력하는 메소드 info()
   // * EmpExam
   //    - Emp를 3명 이상 만들기
   //    - 3명을 배열이나 ArrayList에 넣고
   //    - 반복문으로 각자의 info() 실행
   
   // 문제6
   // * Emp
   //    - 사번, 이름, 직급, 연봉, 상사의 사번
   // * EmpTable
   //    - 사원추가(Emp)
   //    - 출력() : 모든 사원 정보를 출력
   // * EmpExam
   //    - EmpTable도 만들고
   //    - Emp를 3명 이상 만들고
   //    - EmpTable에 Emp 만든거 넣기
   //    - EmpTable에 있는 Emp 정보 출력

   // 문제6-1
   //   연봉이 2000원 이상인 사원만 출력
   // 문제6-2(무슨말인지 모르면 풀지 말자. 성질버린다)
   //   사원1의 상사가 누구인지 출력
   //   (Emp를 잘 만들어둬야 하겠죠?)
	
	// 심화 1
	// G마켓 만들기
	// * 상품
	//		상품명, 가격, 상세정보
	// * 사용자
	// 		ID, 장바구니 [5]
	// * 쇼핑몰 (main)
	// 		1. 상품 3개 이상 진열
	//		2. 회원 2명 이상
	//		3. 회원의 장바구니에 물건 2개 이상씩 담기
	// 		4. 회원별로 장바구니 내역 출력
	
	
}
